In [1]:
import pandas as pd

In [5]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, None, 19]} ##欠損値を含むデータ

df = pd.DataFrame(data1)
df

     Name   Age
0     Tom  20.0
1  Joseph   NaN
2     Bob  19.0

In [6]:
df.isnull() ##欠損値の有無を確認

    Name    Age
0  False  False
1  False   True
2  False  False

In [7]:
df.isnull().sum() ##欠損値の数を確認

Name    0
Age     1
dtype: int64

In [10]:
df["Age"] = df["Age"].fillna(df["Age"].mean()) ##欠損値をAgeの平均値で補完
df

     Name   Age
0     Tom  20.0
1  Joseph  19.5
2     Bob  19.0

In [11]:
df2 = pd.DataFrame(data1)
df2

     Name   Age
0     Tom  20.0
1  Joseph   NaN
2     Bob  19.0

In [12]:
df2.dropna() ##欠損値を含む行を削除

  Name   Age
0  Tom  20.0
2  Bob  19.0